runs/case_02/system/snappyHexMeshDict
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      snappyHexMeshDict;
}

castellatedMesh true;
snap            true;
addLayers       true;

geometry
{
    tailfin.stl
    {
        type triSurfaceMesh;
        name tailfin;
    }
}

castellatedMeshControls
{
    maxLocalCells 1000000;
    maxGlobalCells 2000000;
    minRefinementCells 10;
    maxLoadUnbalance 0.10;
    nCellsBetweenLevels 2;

    features
    (
        {
            file "tailfin.eMesh";
            level 3;
        }
    );

    refinementSurfaces
    {
        tailfin
        {
            level (4 5);
        }
    }

    resolveFeatureAngle 30;

    refinementRegions
    {
    }

    locationInMesh (-0.5 0.1 0.1);
    allowFreeStandingZoneFaces true;
}

snapControls
{
    nSmoothPatch 3;
    tolerance 2.0;
    nSolveIter 30;
    nRelaxIter 5;
    nFeatureSnapIter 10;
    implicitFeatureSnap false;
    explicitFeatureSnap true;
    multiRegionFeatureSnap false;
}



addLayersControls
{
    relativeSizes       false;

    layers
    {
        tailfin
        {
            nSurfaceLayers  8;
        }
    }

    expansionRatio      1.2;
    firstLayerThickness 5e-05; // Starting with manageable ~50 micron first layer
    minThickness        1e-06;

    // v2606 Layer Extrusion Stability Controls
    nGrow               0;
    featureAngle        130;
    slipFeatureAngle    30;
    nRelaxIter          5;
    nRelaxedIter        20;

    minMedialAxisAngle  90;
    maxThicknessToMedialRatio 0.3;
    medialAxisHeadRoom  0.2;

    nBufferCellsNoExtrude 0;
    nSmoothSurfaceNormals 1;
    nSmoothNormals      3;
    nSmoothThickness    10;
    maxFaceThicknessRatio 0.5;
    nLayerIter          50;
    
    // Allow snappy to handle tight corners gracefully
    meshShrinkationWithNoLayers false;
}

meshQualityControls
{
    maxNonOrtho 75;
    maxBoundarySkewness 20;
    maxInternalSkewness 4;
    maxConcave 80;
    minFlatness 0.5;
    minVol 1e-13;
    minTetQuality 1e-15;
    minArea -1;
    minTwist 0.02;
    minDeterminant 0.001;
    minFaceWeight 0.02;
    minVolRatio 0.01;
    minTriangleTwist -1;

    nSmoothScale 4;
    errorReduction 0.75;
}

mergeTolerance 1e-6;


